# 将dataframe保存到mysql中

> 参考链接
> 将pandas的DataFrame数据写入MySQL数据库 + sqlalchemy
> <https://blog.csdn.net/biboshouyu/article/details/54139641>

In [4]:
import pandas as pd  
from sqlalchemy import create_engine  
import numpy as np

df1 = pd.DataFrame({"one":np.random.rand(4), "two":np.linspace(1,4,4), "three":["zhangsan", "lisi", 999.99, 1]})
##将数据写入mysql的数据库，但需要先通过sqlalchemy.create_engine建立连接,且字符编码设置为utf8，否则有些latin字符不能处理  
yconnect = create_engine('mysql+mysqldb://root:root@localhost:3306/text_summarization?'
                         'charset=utf8')  
pd.io.sql.to_sql(df1,'tablename', yconnect, schema='text_summarization',
                 if_exists='append')

In [9]:
from sqlalchemy import create_engine
import pandas as pd
import pymysql
import numpy as np

In [16]:
df1 = pd.DataFrame({"one":np.random.rand(4), "two":np.linspace(1,4,4), "three":["zhangsan", "lisi", 999.99, 1]})
df1

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>one</th>
      <th>three</th>
      <th>two</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0.038695</td>
      <td>zhangsan</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0.300840</td>
      <td>lisi</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.492136</td>
      <td>999.99</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0.826257</td>
      <td>1</td>
      <td>4.0</td>
    </tr>
  </tbody>
</table>
</div>

将df1保存到csv文件中。

In [17]:
df1.to_csv('/Users/sunlu/Workspaces/PyCharm/PythonDiary/database/mysql/test.csv',
           encoding = 'utf-8', index = False)

读取csv文件

In [ ]:
df=pd.read_csv('/Users/sunlu/Workspaces/PyCharm/PythonDiary/database/dataclean/cleanWeiboData.csv',
               sep=',')